app/controllers/settings_controller.rb

    def fetch
        game_id = params['game_id']
        setting = Settings.find_by_game_id(game_id)
---
SELECT "settings".* FROM "settings" WHERE "settings"."game_id" = $1 LIMIT $2  [["game_id", 2], ["LIMIT", 1]]

    def save
        settings = params['settings']
        setting = Settings.find_or_create_by(game_id: settings['game_id'])

        setting.game_id = settings['game_id']
        setting.speed = settings['speed'].downcase
        setting.hole_points = settings['hole_points'].downcase
        setting.gap_spacing = settings['gap_spacing'].downcase
        setting.gap_size = settings['gap_size'].downcase

        setting.red_play = settings['worms']['red']['play']
        setting.blue_play = settings['worms']['blue']['play']
        setting.green_play = settings['worms']['green']['play']
        setting.yellow_play = settings['worms']['yellow']['play']
        setting.purple_play = settings['worms']['purple']['play']
        setting.cyan_play = settings['worms']['cyan']['play']

        setting.red_left = settings['worms']['red']['left']
        setting.red_right = settings['worms']['red']['right']
        setting.blue_left = settings['worms']['blue']['left']
        setting.blue_right = settings['worms']['blue']['right']
        setting.green_left = settings['worms']['green']['left']
        setting.green_right = settings['worms']['green']['right']
        setting.yellow_left = settings['worms']['yellow']['left']
        setting.yellow_right = settings['worms']['yellow']['right']
        setting.cyan_left = settings['worms']['cyan']['left']
        setting.cyan_right = settings['worms']['cyan']['right']
        setting.purple_left = settings['worms']['purple']['left']
        setting.purple_right = settings['worms']['purple']['right']

        setting.save!
---
INSERT INTO "settings" ("game_id", "speed", "ENUM('slow', 'normal', 'frantic') DEFAULT 'normal'", "hole_points", "ENUM('none', 'one') DEFAULT 'none'", "gap_spacing", "ENUM('close', 'normal', 'far_apart') DEFAULT 'normal'", "gap_size", "ENUM('small', 'normal', 'large') DEFAULT 'normal'", "red_play", "blue_play", "green_play", "yellow_play", "purple_play", "cyan_play", "red_left", "red_right", "blue_left", "blue_right", "green_left", "green_right", "yellow_left", "yellow_right", "cyan_left", "cyan_right", "purple_left", "purple_right", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24, $25, $26, $27, $28, $29) RETURNING "id"
SELECT "settings".* FROM "settings" WHERE "settings"."game_id" = $1 LIMIT $2  [["game_id", "2cb41977-ff48-4beb-9762-38309b67fce2"], ["LIMIT", 1]]
UPDATE "settings" SET "speed" = $1, "hole_points" = $2, "gap_spacing" = $3, "gap_size" = $4, "red_play" = $5, "blue_play" = $6, "red_left" = $7, "red_right" = $8, "blue_left" = $9, "blue_right" = $10, "green_left" = $11, "green_right" = $12, "yellow_left" = $13, "yellow_right" = $14, "cyan_left" = $15, "cyan_right" = $16, "purple_left" = $17, "purple_right" = $18, "updated_at" = $19 WHERE "settings"."id" = $20